# впишите свой код внутри этой функции
def check_age(age: int):
    if age >= 18: # если пользователю 18 и больше лет, он может водить
        result = 'Доступ разрешён'
    else: # пользователю меньше 18 лет
        result = 'Доступ запрещён'

    # print(result) # раскомментируйте эту строку, если хотите проверить  результат вашего кода
    return result # не изменяйте этот код



# впишите свой код внутри этой функции
def check_triangle(side1: int, side2: int, side3: int):
    if side1 + side2 > side3 and side1 + side3 > side2 and side2 + side3 > side1: # Впишите код для проверки условия, что выполняется условие треугольника и треугольник существует
        if side1 <= 0 or side2 <= 0 or side3 <= 0: # Впишите код для проверки условия, что стороны треугольника заданы неверно (0 или отрицательное значение)
            result = 'Треугольник не существует' # Впишите результат выполнения условия
        elif side1 == side2 and side1 == side3:  # Впишите код для проверки условия, что все стороны равны и треугольник равносторонний
            result = 'Равносторонний треугольник' # Впишите результат выполнения условия
        elif (side1 == side2 and side1 != side3) or (side1 == side3 and side1 != side2) or (side2 == side3 and side2 != side1): # Впишите код для проверки условия, что любые две стороны равны и треугольник равнобедренный
            result = 'Равнобедренный треугольник' # Впишите результат выполнения условия
        else: # в остальных случаях треугольник разносторонний
            result = 'Разносторонний треугольник' # Впишите результат выполнения условия
    else: # правило треугольника не выполняется, треугольник не существует
        result = 'Треугольник не существует' # Впишите результат выполнения альтернативного условия

    # print(result) # раскомментируйте эту строку, если хотите проверить результат вашего кода
    return result


# впишите свой код внутри этой функции
# используйте переменную result для хранения результата вашего решения
def fio(initials: list[str]) -> str:
    result = initials[0][0] + initials[1][0] + initials[2][0]

    # print(result) # раскомментируйте эту строку, если хотите проверить результат вашего кода
    return result # этот код менять не нужно

# примеры входных данных и результат, который у вас должен получиться:
# ['Гагарин', 'Юрий', 'Алексеевич'] - ответ: ГЮА
# ['Бисмарк', 'Отто', 'фон'] - ответ: БОф

initials = ['Бисмарк', 'Отто', 'фон']






